Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And Nicodemus came (he who had first come to Jesus by night) with a roll of myrrh and aloes mixed, about a hundred pounds.
chr: ᎾᏍᏉᏃ ᎥᎤᎷᏨᎩ ᏂᎦᏗᎹᏏ, ᎾᏍᎩ ᎢᎬᏱᏱ ᏥᏌ ᎡᏃᏱ ᎤᎷᏤᎸᎯ, ᎤᏲᎸᎩ ᏗᏜᏍᏔᏅᎯ ᎻᎳ ᎡᎳᏫᏃ, ᎠᏍᎪᎯᏧᏈ ᎢᏴᏛ ᎢᏳᏓᎨᏛ.

source: Then they took the body of Jesus, folding linen about it with the spices, as is the way of the Jews when they put the dead to rest.
chr: ᎿᏉᏃ ᎤᏂᏁᏒᎩ ᏥᏌ ᎠᏰᎸᎢ ᎠᎴ ᏙᎴᏛ ᎠᏄᏬ ᎤᏂᏣᏄᎶᏔᏅᎩ, ᎠᎴ ᎾᏍᏉ ᏗᎦᏩᏒᎩ ᏚᏂᏣᏄᎳᏅᎩ, ᎾᏍᎩᏯ ᎢᏳᎾᏛᏁᏗ ᎨᏒ ᎠᏂᏧᏏ ᏓᎾᏓᏂᏌ.

source: Now there was a garden near the cross, and in the garden a new place for the dead in which no man had ever been put.
chr: ᎾᎿᏃ ᎠᎦᏛᏅ ᎠᏫᎡᏗᏱ ᎪᏢᏒᎩ; ᎾᎿᏃ ᎠᏫᏒᏗᏱ ᎢᏤ ᏗᏓᏂᏐᏗᏱ ᎪᏢᏒᎩ ᎩᎶ ᎠᏥᏂᏌᏅ ᎠᏏ ᏂᎨᏒᎾ.

source: So they put Jesus there, because it was the Jews' day of getting ready for the Passover, and the place was near.
chr: ᎾᎿᏃ ᎤᏂᏅᏅᎩ ᏥᏌ ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎠᏂᏧᏏ ᎤᎾᏤᎵᎦ ᎠᏛᏅᎢᏍᏙᏗᏱ ᎢᎦ ᎨᏒᎢ; ᏗᏓᏂᏐᏗᏱᏰᏃ ᎾᎥᏉ ᎨᏒᎩ.

source: Now on the first day of the week, very early, while it was still dark, Mary Magdalene came to the place and saw that the stone had been taken away from it.
chr: ᎠᎴᏂᏍᎬᎢᏃ ᎢᎦ ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒᎢ, ᎺᎵ ᎹᎩᏕᎵ ᎡᎯ ᏑᎾᎴᎢᏳ, ᎠᏏᏉ ᎤᎵᏏᎬᎩ, ᎤᎷᏨᎩ ᎠᏤᎵᏍᏛᎢ, ᎠᎴ ᎤᎪᎲᎩ ᏅᏯ ᎠᎲᏛ ᎨᏒᎩ ᎠᏤᎵᏍᏛᎢ.

source: Then she went running to Simon Peter, and to the other disciple who was loved by Jesus, and said to them, They have taken away the Lord out of the place of the dead and we have no knowledge where they have put him.
chr: ᎿᏉᏃ ᏚᏍᏆᎸᏔᏅᎩ, ᏌᏩᏂ ᏈᏓ ᏭᎷᏤᎸᎩ, ᎠᎴ ᎾᏍᏉ ᏐᎢ ᎠᏓᏍᏓᏩᏗᏙᎯ, ᎾᏍᎩ ᏥᏌ ᎤᎨᏳᎯ, ᎯᎠ ᏫᏂᏚᏪᏎᎸᎩ; ᎤᏂᏁᏒ ᎤᏂᏄᎪᏫᏒ ᎤᎬᏫᏳᎯ ᎠᏤᎵᏍᏛᎢ, ᎠᎴ ᎥᏝ ᏲᏥᎦᏔᎭᏭᏂᏅᏅᎢ.

source: So Peter and the other disciple went out to the place of the dead.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏈᏓ ᎤᏄᎪᏨᎩ, ᎠᎴ ᏐᎢ ᎠᏓᏍᏓᏩᏗᏙᎯ, ᎠᎴ ᎠᏤᎵᏍᏛ ᎤᏂᎷᏨᎩ.

source: They went running together, and the other disciple got in front of Peter and came first to the hole in the rock;
chr: ᎿᏉᏃ ᎾᏍᎩ ᎠᏂᏔᎵ ᎢᏧᎳᎭ ᏚᏂᏍᏆᎸᏔᏅᎩ; ᏐᎢᏃ ᎠᏓᏍᏓᏩᏗᏙᎯ ᏚᏓᎩᏴᎩ, ᎢᎬᏱ ᎠᏤᎵᏍᏛ ᎤᎷᏨᎩ.

source: And looking in, he saw the linen bands on the earth; but he did not go in,
chr: ᎾᏍᎩᏃ ᎤᏗᏌᏓᏛ ᏚᎪᎲᎩ ᏙᎴᏛ ᏗᏄᏬ ᏕᎦᏅᎩ; ᎠᏎᏃ ᎥᏝ ᏳᏴᎴᎢ.

source: Then Simon Peter came after him and went into the hole in the rock; and he saw the linen bands on the earth,
chr: ᎿᏉᏃ ᏌᏩᏂ ᏈᏓ ᎣᏂᏉ ᎤᎷᏨᎩ, ᎠᎴ ᎠᏤᎵᏍᏛ ᏭᏴᎸᎩ, ᎠᎴ ᏚᎪᎲᎩ ᏙᎴᏛ ᏗᏄᏬ ᏕᎦᏅᎢ.

source: And the cloth, which had been round his head, not with the linen bands but rolled up in a place by itself.
chr: ᎠᏯᏠᏃ ᎤᏂᏍᏚᎶᏔᏅᎯ ᎥᏝ ᏙᎴᏛ ᏗᏄᏬ ᏕᎦᏅ ᏱᎦᏁᎢ, ᎤᏁᎳᎩ ᎦᏇᏅᎯ ᎢᏴᏛ ᏫᎦᏅᎩ.

source: Then the other disciple who came there first went in; and he saw and belief came to him.
chr: ᎿᏉᏃ ᎾᏍᏉ ᏐᎢ ᎠᏓᏍᏓᏩᏗᏙᎯ, ᎢᎬᏱ ᎤᎷᏨᎯ ᎠᏤᎵᏍᏛ, ᎤᏴᎸᎩ; ᎠᎴ ᎤᎪᎲᎩ ᎠᎴ ᎤᏬᎯᏳᏅᎩ.

source: For at that time they had no knowledge that the Writings said that he would have to come again from the dead.
chr: ᏝᏰᏃ ᎠᏏ ᏯᏃᎵᎨ ᎦᏛᎬ ᎪᏪᎸᎢ, ᎾᏍᎩ ᎤᏲᎱᏒ ᏧᎴᎯᏐᏗ ᎨᏒᎢ.

source: So then the disciples went away again to their houses.
chr: ᎿᏉᏃ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ ᎤᎾᏓᏅᏒᎩ, ᏔᎵᏁ ᏙᏧᏁᏅᏒ ᏭᏂᎶᏒᎩ.

source: But Mary was still there outside the hole in the rock, weeping; and while she was weeping and looking into the hole,
chr: ᎺᎵᏍᎩᏂ ᎠᏤᎵᏍᏛ ᏙᏱᏗᏢ ᎦᎶᎯᏍᏗᏱ ᎦᏙᎬᎩ, ᏓᏠᏱᎲᎩ; ᏓᏠᏱᎲᎩ ᎤᏗᏌᏓᏛᎩ, ᎠᏤᎵᏍᏛ ᎭᏫᏂ ᏫᏚᎧᎾᏅᎩ,

source: She saw two angels in white seated where the body of Jesus had been, one at the head and the other at the feet.
chr: ᎠᎴ ᏫᏚᎪᎲᎩ ᎤᏁᎬ ᏚᎾᏣᏅᏛᎩ ᎠᏂᏔᎵ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏚᏃᎸᎩ, ᏌᏉ ᎤᎵᏍᏘᏅᎢ, ᏐᎢᏃ ᏚᏜᏌᏔᏅᎢ.

source: They said to her, Woman, why are you weeping? She said to them, Because they have taken away my Lord, and I have no knowledge where they have put him.
chr: ᎯᎠᏃ ᏅᎬᏩᏪᏎᎸᎩ; ᎯᎨᏴ, ᎦᏙᏃ ᏙᎭᏠᏱᎭ? ᎯᎠᏃ ᏂᏚᏪᏎᎸᎩ; ᏅᏗᎦᎵᏍᏙᏗᎭ ᎤᏂᏁᏒ ᎤᎬᏫᏳᎯ ᎠᏆᏤᎵᎦ, ᎠᎴ ᎤᏂᏅᏅ ᏂᏥᎦᏔᎲᎾ ᎨᏒᎢ.

source: And then looking round, she saw Jesus there, but had no idea that it was Jesus.
chr: ᎾᏍᎩᏃ ᏄᏪᏒ ᎤᎦᏔᎲᏒᎩ; ᎠᎴ ᎤᎪᎲᎩ ᏥᏌ ᎦᏙᎬᎩ, ᎠᎴ ᎥᏝ ᏳᏬᎵᏤ ᏥᏌ ᎨᏒᎢ.

source: Jesus said to her, Woman, why are you weeping? who are you looking for? She, taking him for the gardener, said to him, Sir, if you have taken him away from here, say where you have put him and I will take him away.
chr: ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎯᎨᏴ, ᎦᏙᏃ ᏙᎭᏠᏱᎭ? ᎦᎪ ᎯᏲᎭ? ᎠᏫᏒᏗᏱ ᎣᏍᏛ ᎢᏳᏩᎿᏕᎩ ᎤᏪᎵᏒᎩ, ᎯᎠ ᏄᏪᏎᎸᎩ; ᎯᏍᎦᏯ, ᎢᏳᏃ ᏂᎯ ᎯᎾᏫᏛᎮᏍᏗ, ᏍᎩᏃᎲᏏ ᏫᏅᏅᎢ, ᎠᏴᏃ ᏓᏥᎾᏫᏛᎯ.

source: Jesus said to her, Mary! Turning, she said to him in Hebrew, Rabboni! (which is to say, Master).
chr: ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎺᎵ. ᎺᎵ ᎤᎦᏔᎲᏒ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎳᏉᏂ, ᎾᏍᎩ ᎦᏛᎬᎢ, ᏗᏍᏇᏲᎲᏍᎩ.

source: Jesus said to her, Do not put your hand on me, for I have not gone up to the Father: but go to my brothers and say to them, I go up to my Father and your Father, to my God and your God.
chr: ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᏞᏍᏗ ᏍᏆᏒᏂᎸᎩ, ᏝᏰᏃ ᎠᏏ ᎡᏙᏙᏱ ᏫᏯᏆᎵᏌᎳᏓᏅ; ᎮᎾᏉᏍᎩᏂ ᎣᏣᎵᏅᏟ ᏗᏂᏅᎢ, ᎯᎠᏃ ᏫᏂᎩᏪᏏ; ᎡᏙᏙᏱ ᎠᏆᎵᏌᎳᏓᏂᏗ ᎠᎴ ᏂᎯ ᎢᏥᏙᏙᏱ; ᎠᏆᏤᎵᎦ ᎤᏁᎳᏅᎯᏱ, ᎠᎴ ᎢᏣᏤᎵᎦ ᎤᏁᎳᏅᎯᏱ.

source: Mary Magdalene went with the news to the disciples, and said she had seen the Lord and that he had said these things to her.
chr: ᎺᎵ ᎹᎩᏕᎵ ᎡᎯ ᎤᎷᏨᎩ ᎠᎴ ᏚᏃᏁᎸᎩ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ ᎤᎪᎲ ᎤᎬᏫᏳᎯ, ᎠᎴ ᎾᏍᎩ ᏄᏪᏒ ᎤᎵᏃᎮᏔᏅᎢ.

source: At evening on that day, the first day of the week, when, for fear of the Jews, the doors were shut where the disciples were, Jesus came among them and said to them, May peace be with you!
chr: ᎿᏉᏃ ᎾᎯᏳ ᎢᎦ ᎤᏒᎢ, ᎠᎴᏂᏍᎬ ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒᎢ, ᎦᎶᎯᏍᏗᏱ ᏓᏍᏚᎲᎩ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ ᏓᏂᎳᏫᎥᎢ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬ ᏓᏂᏍᎦᎢᎲ ᎠᏂᏧᏏ, ᎤᎷᏨᎩ ᏥᏌ, ᎠᏰᎵ ᎤᎴᏅᎩ, ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᏅᏩᏙᎯᏯᏛ ᎢᏣᏤᎵᎦ ᎨᏎᏍᏗ.

source: And when he had said this, he let them see his hands and his side. Then the disciples were glad when they saw the Lord.
chr: ᎾᏍᎩᏃ ᏄᏪᏒ, ᏚᎾᏄᎪᏫᏎᎸᎩ ᏧᏬᏰᏂ ᎠᎴ ᎠᏍᏆᎨᏂ. ᎿᏉᏃ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎣᏍᏛ ᎤᎾᏓᏅᏓᏛᎩ ᎤᏂᎪᎲ ᎤᎬᏫᏳᎯ.

source: And Jesus said to them again, May peace be with you! As the Father sent me, even so I now send you.
chr: ᎿᏉᏃ ᏔᎵᏁ ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᏅᏩᏙᎯᏯᏛ ᎢᏣᏤᎵᎦ ᎨᏎᏍᏗ. ᎡᏙᏓ ᎠᎩᏅᏒᎢ ᎾᏍᎩᏯ ᎢᏨᏅᎵ.

source: And when he had said this, breathing on them, he said to them, Let the Holy Spirit come on you:
chr: ᎾᏍᎩᏃ ᏄᏪᏒ, ᏚᏦᏔᎲᎩ, ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᏗᏣᏓᏂᎸᎩ.

source: Any to whom you give forgiveness, will be made free from their sins; and any from whom you keep back forgiveness, will still be in their sins.
chr: ᎩᎶ ᎤᏍᎦᏅᏨ ᏕᏥᏲᏍᎨᏍᏗ ᏗᏲᏒᎯ ᎨᏎᏍᏗ, ᎩᎶᏃ ᎤᏍᎦᏅᏨ ᏕᏥᏂᏱᏍᎨᏍᏗ ᏗᎦᏂᏴᏗ ᎨᏎᏍᏗ.

source: Now Thomas, one of the twelve, named Didymus, was not with them when Jesus came.
chr: ᎠᏎᏃ ᏓᎻ, ᏔᎳᏚ ᎢᏯᏂᏛ ᎨᎳ, ᏗᏗᎹ ᏧᏙᎢᏛ, ᎥᏝ ᏱᎨᎴ ᏥᏌ ᎤᎷᏨ.

source: So the other disciples said to him, We have seen the Lord. But he said to them, If I do not see in his hands the print of the nails and put my finger into the print of the nails, and if I do not put my hand into his side, I will never have belief.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏂᏐᎢ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ ᎯᎠ ᏂᎬᏩᏪᏎᎸᎩ; ᎣᏥᎪᎥ ᎤᎬᏫᏳᎯ. ᎠᏎᏃ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᎥᏝ ᏴᎦᎪᎢᏳᎲᎦ ᎬᏂ ᏧᏬᏰᏂ ᏴᎩ ᏚᏰᎸᏒ ᏱᏓᎩᎪᎲ, ᎠᎴ ᏥᏰᏌᏛ ᏯᏋᏔᏅ ᏯᎩᏃᏟᏍᏔᏅ ᏴᎩ ᏚᏰᎸᏒᎢ, ᎠᎴ ᎠᏍᏆᎨᏂ ᏯᏆᏐᎾᏛ.

source: And after eight days, his disciples were again in the house and Thomas was with them. Though the doors were shut, Jesus came, and taking his place in the middle of them, he said, May peace be with you!
chr: ᏧᏁᎵᏁᏃ ᎢᎦ ᏔᎵᏁ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎠᏂᏯᎥᎩ ᎦᎵᏦᏕ, ᎠᎴ ᏓᎻ ᎨᎸᎩ. ᏥᏌ ᎤᎷᏨᎩ, ᏗᎦᎶᎯᏍᏗᏱ ᏓᏍᏚᎲᎩ, ᎠᏰᎵ ᎤᎴᏅᎩ, ᎯᎠ ᏄᏪᏒᎩ; ᏅᏩᏙᎯᏯᏛ ᎢᏣᏤᎵᎦ ᎨᏎᏍᏗ.

source: Then he said to Thomas, Put out your finger, and see my hands; and put your hand here into my side: and be no longer in doubt but have belief.
chr: ᎿᏉᏃ ᎯᎠ ᏄᏪᏎᎸᎩ ᏓᎻ; ᎡᏍᎦ ᎡᏅᎦ ᎯᏰᏌᏛᎢ, ᏘᎪᎵᏯ ᏗᏉᏰᏂ, ᎠᎴ ᎡᏍᎦ ᎡᏅᎦ ᏦᏰᏂ ᏥᏍᏆᎨᏂ ᏩᏐᎾᏓ, ᎠᎴ ᏞᏍᏗ ᏃᎯᏳᎲᏍᎬᎾ ᏱᎨᏎᏍᏗ, ᎰᎯᏳᎲᏍᎩᏍᎩᏂ ᎨᏎᏍᏗ.

source: And Thomas said in answer, My Lord and my God!
chr: ᏓᎻ ᎤᏁᏨᎩ, ᎯᎠ ᏄᏪᏎᎸᎩ; ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵᎦ, ᎠᎴ ᏣᏁᎳᏅᎯ ᎠᏆᏤᎵᎦ!

source: Jesus said to him, Because you have seen me you have belief: a blessing will be on those who have belief though they have not seen me!
chr: ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᏥᏍᎩᎪᏩᏛ ᏅᏓᎦᎵᏍᏙᏓ ᎰᎯᏳᎲᏍᎦ; ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎬᎩᎪᎲᎯ ᏂᎨᏒᎾ ᎠᏎᏃ ᏥᎬᏉᎯᏳᎲᏍᎪᎢ.

source: A number of other signs Jesus did before his disciples which are not recorded in this book:
chr: ᎠᎴ ᎤᏣᏛᎩ ᎤᏟ ᎢᎦᎢ ᎤᏍᏆᏂᎪᏗ ᏚᎸᏫᏍᏓᏁᎸ ᏥᏌ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎠᏂᎦᏔᎲᎢ, ᎠᏂ ᎪᏪᎵᎯ ᏂᎪᏪᎸᎾ;

source: But these are recorded, so that you may have faith that Jesus is the Christ, the Son of God, and so that, having this faith you may have life in his name.
chr: ᎯᎠᏍᎩᏂ ᎪᏪᎳ ᎢᏦᎯᏳᏗᏱ ᏥᏌ ᎦᎶᏁᏛ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎨᏒᎢ, ᎢᏦᎯᏳᎲᏍᎬᏃ ᎬᏂᏛ ᎢᏣᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩ ᏚᏙᎥ ᏅᏓᏳᎵᏰᎢᎸᏍᏙᏗᏱ.

source: After these things Jesus let himself be seen again by the disciples at the sea of Tiberias; and it came about in this way.
chr: ᎾᏍᎩᏃ ᏄᎵᏍᏔᏂᏙᎸ, ᏥᏌ ᏔᎵᏁ ᎬᏂᎨᏒ ᏂᏚᏛᏁᎸᎩ ᎬᏩᏍᏓᏩᏗᏙᎯ ᏔᏈᎵᏯ ᎥᏓᎸᎢ. ᎯᎠᏃ ᏄᎵᏍᏔᏂᏙᎸᎩ ᎬᏂᎨᏒ ᏄᏛᏁᎸᎩ.

source: Simon Peter, Thomas named Didymus, Nathanael of Cana in Galilee, the sons of Zebedee, and two others of his disciples were all together.
chr: ᎢᏧᎳᎭ ᎠᏂᏅᎩ ᏌᏩᏂ ᏈᏓ, ᎠᎴ ᏓᎻ ᏗᏗᎹ ᏧᏙᎢᏛ, ᎠᎴ ᏁᏓᏂᎵ ᎨᎵᎵ ᎡᎯ ᎨᏂ ᎦᏚᎲᎢ, ᎠᎴ ᏤᏈᏗ ᏧᏪᏥ, ᎠᎴ ᎠᏂᏔᎵ ᏅᏩᎾᏓᎴ ᎬᏩᏍᏓᏩᏗᏙᎯ.

source: Simon Peter said to them, I am going fishing. They said to him, And we will come with you. They went out and got into the boat; but that night they took no fish.
chr: ᏌᏩᏂ ᏈᏓ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᏥᎦᏯᎷᏂ. ᎯᎠ ᏅᎬᏩᏪᏎᎸᎩ; ᎠᏴ ᎾᏍᏉ ᏓᏕᏏ. ᎤᏁᏅᏒᎩ, ᎩᎳᏉᏃ ᎢᏴᏛ ᏥᏳᎯ ᎤᎾᏣᏅᎩ; ᎾᎯᏳᏃ ᏒᏃᏱ ᎥᏝ ᎪᎱᏍᏗ ᏳᏂᏂᏴᎮᎢ.

source: Now very early in the morning Jesus was there by the edge of the sea (though the disciples were not conscious that it was Jesus).
chr: ᏑᎾᎴᏃ ᏄᎵᏍᏔᏅ, ᏥᏌ ᎤᏩᏝᎥ ᎦᏙᎬᎩ; ᎠᏎᏃ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎥᏝ ᏯᏂᎦᏔᎮ ᏥᏌ ᎨᏒᎢ.

source: So Jesus said to them, Children, have you taken any fish? They made answer, No.
chr: ᎿᏉᏃ ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᏗᏥᏲᎵ, ᎢᏥᏂᏌᎠᏧ? ᎥᏝ, ᎤᎾᏛᏅᎩ.

source: And he said to them, Let down the net on the right side of the boat and you will get some. So they put it in the water and now they were not able to get it up again because of the great number of fish.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎸᎩ; ᏥᏳᎯ ᎠᎦᏘᏏᏗᏢ ᎢᏥᎦᏯᎷᎥᎦ, ᏙᏓᏥᏩᏛᎯᏃ. ᎰᏩᏃ ᎤᏂᎦᏯᎷᏅᎩ, ᎿᏉᏃ ᎥᏝ ᏰᎵ ᎬᏩᎾᏎᎯᏍᏗ ᏱᎨᏎᎢ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎤᏂᏣᏛ ᎠᏣᏗ.

source: So the disciple who was dear to Jesus said to Peter, It is the Lord! Hearing that it was the Lord, Peter put his coat round him (because he was not clothed) and went into the sea.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏓᏍᏓᏩᏗᏙᎯ ᏥᏌ ᎤᎨᏳᎯ ᎯᎠ ᏄᏪᏎᎸᎩ ᏈᏓ; ᎤᎬᏫᏳᎯ ᎾᏍᎩ. ᎿᏉᏃ ᏌᏩᏂ ᏈᏓ ᎤᏛᎦᏅ ᎾᏍᎩ ᎤᎬᏫᏳᎯ ᎨᏒᎢ, ᎦᏚᎢ ᎤᏄᏬᏍᏗ ᎤᏓᏠᏍᏔᏅᎩ, ᏂᏚᏄᏩᎥᎾᏰᏃ ᎨᏒᎩ, ᎠᎴ ᎥᏓᎵ ᏭᎵᏔᏗᏅᏒᎩ.

source: And the other disciples came in the little boat (they were not far from land, only about two hundred cubits off) pulling the net full of fish.
chr: ᎠᏂᏐᎢᏃ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ ᏥᏳ ᎤᎾᏦᏛᎩ, ᎤᏂᎷᏨᎩ, ᎥᏝᏰᏃ ᎢᏅᎯᏳ ᏱᎨᏎ ᏙᏱ, ᏔᎵᏧᏈᏉ ᎢᏯᎵᎩᏳᏍᏈᏛ ᎢᏴᏛ ᏅᏩᏍᏛᎩ, ᎠᎦᏯᎷᏗ ᎠᏣᏗ ᎠᎧᎵᏬᎯ ᎠᏂᎾᏏᏁᎲᎩ.

source: When they got to land, they saw a fire of coals there, with fish cooking on it, and bread.
chr: ᎤᎾᏚᎩᏒᏃ ᎤᏂᎪᎲᎩ ᎠᏥᎸᎭ ᎪᏛᎩ, ᎠᏣᏗᏃ ᎥᎬᏓᎥᎩ, ᎠᎴ ᎦᏚ ᏓᎲᎩ.

source: Jesus said to them, Get some of the fish which you have now taken.
chr: ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᎡᏗᏥᏄᎦ ᎢᎦᏛ ᎠᏣᏗ ᎩᎳᏉ ᏥᏕᏥᏂᏴ.

source: So Peter went to the boat and came back pulling the net to land, full of great fish, a hundred and fifty-three; and though there was such a number the net was not broken.
chr: ᏌᏩᏂ ᏈᏓ ᏭᏣᏅᎩ, ᎠᎴ ᏙᏱ ᏭᎾᏏᏃᎸᎩ ᎠᎦᏯᎷᏗ ᎠᎧᎵᏬᎯ ᏣᏁᏆ ᎠᏣᏗ, ᏍᎪᎯᏧᏈ ᎯᏍᎩᏍᎪᎯ ᏦᎢᎦᎵ ᎤᏂᎥᎩ. ᎾᏍᎩᏒᎦᏃ ᎾᏂᎥᎽ ᎠᏎᏃ ᎠᎦᏯᎷᏗ ᎥᏝ ᏳᏲᏤᎢ.

source: Jesus said to them, Come and take some food. And all the disciples were in fear of putting the question, Who are you? being conscious that it was the Lord.
chr: ᏥᏌ ᎯᎠ ᏂᏚᏪᏎᎸᎩ; ᎡᏣᎵᏍᏓᏴᏄᎦ. ᎥᏝᏃ ᎩᎶ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ, ᎦᎪ ᏂᎯ, ᎬᏬᏎᏗ ᏱᎨᏎᎢ, ᎠᏂᎦᏔᎲᎩᏰᏃ ᎤᎬᏫᏳᎯ ᎨᏒᎢ.

source: Then Jesus came and took the bread and gave it to them, and the fish in the same way.
chr: ᏥᏌ ᎤᎷᏨᎩ ᎤᎩᏒᎩ ᎦᏚ ᎠᎴ ᏚᏁᎸᎩ, ᎠᎴ ᎾᏍᏉ ᎠᏣᏗ ᏚᏅᏁᎸᎩ.

source: Now this was the third time that Jesus let himself be seen by the disciples after he had come back from the dead.
chr: ᎾᏍᎩ ᎯᎠ ᎿᏉ ᏦᎢᏁ ᏥᏌ ᎬᏂᎨᏒ ᏂᏚᏛᏁᎸ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎤᏲᎱᏒ ᏚᎴᏅ ᏅᏓᏳᏓᎴᏅᏛ.

source: Then when they had taken food, Jesus said to Simon Peter, Simon, son of John, is your love for me greater than the love of these others? He said to him, Yes, Lord; you are certain of my love for you. He said to him, Then give my lambs food.
chr: ᎿᏉᏃ ᎤᎾᎵᏍᏓᏴᏃᏅ, ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ ᏌᏩᏂ ᏈᏓ; ᏌᏩᏂ, ᏦᎾ ᎤᏪᏥ, ᏂᎯ ᎤᏟ ᏂᏍᎩᎨᏳᎭ ᎡᏍᎦᏉ ᎯᎠ? ᎯᎠ ᏄᏪᏎᎸᎩ; ᎥᎥ, ᏣᎬᏫᏳᎯ, ᎯᎦᏔᎭ ᎬᎨᏳᎢᏳ ᎨᏒᎢ. ᎯᎠ ᏄᏪᏎᎸᎩ; ᏕᎮᎶᎮᏍᏗ ᏗᏆᏤᎵᎦ ᎤᏂᏃᏕᎾ ᎠᏂᎩᎾ.

source: Again, a second time, he said to him, Simon, son of John, have you any love for me? Yes, Lord, he said, you are certain of my love for you. Then take care of my sheep, said Jesus.
chr: ᏔᎵᎾ ᎯᎠ ᏅᎤᏪᏎᎸᎩ; ᏌᏩᏂ, ᏦᎾ ᎤᏪᏥ, ᏍᎩᎨᏳᎭᏧ? ᎯᎠ ᏄᏪᏎᎸᎩ; ᎥᎥ ᏣᎬᏫᏳᎯ, ᎯᎦᏔᎭ ᎬᎨᏳᎢᏳ ᎨᏒᎢ. ᎯᎠ ᏄᏪᏎᎸᎩ; ᏕᎮᎶᎮᏍᏗ ᏗᏆᏤᎵᎦ ᎤᏂᏃᏕᎾ.

source: He said to him a third time, Simon, son of John, am I dear to you? Now Peter was troubled in his heart because he put the question a third time, Am I dear to you? And he said to him, Lord, you have knowledge of all things; you see that you are dear to me. Jesus said to him, Then give my sheep food.
chr: ᏦᎢᏁ ᎯᎠ ᏄᏪᏎᎸᎩ; ᏌᏩᏂ, ᏦᎾ ᎤᏪᏥ, ᏍᎩᎨᏳᎭᏧ? ᏈᏓ ᎤᏲᎢᏳ ᎤᏓᏅᏓᏛᎩ ᏅᏓᏳᎵᏍᏙᏔᏅᎩ ᏦᎢᏁ ᏍᎩᎨᏳᎭᏧ ᎤᏬᏎᎸᎢ. ᎯᎠᏃ ᏄᏪᏎᎸᎩ; ᏣᎬᏫᏳᎯ ᏂᎦᎥ ᎪᎱᏍᏗ ᎯᎦᏔᎭ, ᎯᎦᏔᎭ ᎬᎨᏳᎢᏳ ᎨᏒᎢ. ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᏕᎮᎶᎮᏍᏗ ᏗᏆᏤᎵᎦ ᎤᏂᏃᏕᎾ.

source: Truly I say to you, When you were young, you made yourself ready and went wherever you had a desire to go: but when you are old, you will put out your hands and another will make you ready, and you will be taken where you have no desire to go.
chr: ᎤᏙᎯᏳᎯᏯ, ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᎬᏪᏎᎭ; ᎯᏫᏅ ᏥᎨᏒᎩ ᏨᏒ ᎭᏓᏠᎯᎲᎩ, ᎠᎴ ᏣᏚᎵᏍᎬ ᎮᏙᎲᎩ; ᏣᏛᏐᏅᎯᏍᎩᏂ ᎨᏎᏍᏗ ᏙᏔᏐᎸᏔᏂ, ᏅᏩᏓᎴᏃ ᏓᏣᏠᎵ, ᎠᎴ ᏂᏣᏚᎵᏍᎬᎾ ᎨᏒ ᏮᏓᏣᏘᏅᏍᏔᏂ.

source: Now this he said, pointing out the sort of death by which he would give God glory. And after saying this, he said to him, Come after me.
chr: ᎾᏍᎩ ᏄᏪᏒᎩ ᎤᏪᏛᏨᎩ ᎢᏳᎵᏍᏓᏁᏗᏱ ᎤᏲᎱᎯᏍᏗᏱ ᎨᏒᎢ, ᎾᏍᎩᏃ ᎤᎸᏉᏙᏗᏱ ᎤᏁᎳᏅᎯ. ᎾᏍᎩᏃ ᏁᏪᏒ, ᎯᎠ ᏄᏪᏎᎸᎩ; ᏍᎩᏍᏓᏩᏚᎦ.

source: Then Peter, turning round, saw the disciple who was dear to Jesus coming after them--the disciple who was resting on his breast at the last meal, and said, Lord, who is it who will be false to you?
chr: ᏈᏓᏃ ᎤᎦᏔᎲᏒ ᎤᎪᎲᎩ ᎠᏓᏍᏓᏩᏗᏒᎩ ᏥᏌ ᎤᎨᏳᎯ ᎠᏓᏍᏓᏩᏗᏙᎯ, ᎾᏍᎩ ᎤᏍᏛᎦᎸᏅᎯ ᏥᏌ ᎦᏁᏥᏱ ᎠᎾᎵᏍᏓᏴᎲᏍᎬᎢ, ᎠᎴ ᎯᎠ ᎢᏳᏪᏛ ᏥᎩ; ᏣᎬᏫᏳᎯ, ᎦᎪ ᎾᏍᎩ ᏣᏡᏗᏍᎩ.

source: Seeing him, Peter said to Jesus, What about this man?
chr: ᏈᏓ ᎾᏍᎩ ᎤᎪᎲ, ᎯᎠ ᏄᏪᏎᎸᎩ ᏥᏌ; ᏣᎬᏫᏳᎯ, ᎯᎠᎾᏃ ᎦᏙᎢ?

source: Jesus said to him, If it is my desire for him to be here till I come back, what is that to you? come yourself after me.
chr: ᏥᏌ ᎯᎠ ᏄᏪᏎᎸᎩ; ᎢᏳᏃ ᏥᎷᏨᎭ ᎬᏗᏍᎩ ᎡᎮᏍᏗ ᏯᏇᎵᏒ, ᎦᏙ ᎾᏍᎩ ᏨᏙᏗ? ᏍᎩᏍᏓᏩᏚᎦᏉ.

source: So this saying went about among the brothers that this disciple would not undergo death: Jesus, however, did not say that he would not undergo death, but, If it is my desire for him to be here till I come back, what is that to you?
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᎾᏓᏅᏟ ᎠᏁᎲ ᎤᏰᎵᏒᎩ ᎯᎠ ᎾᏂᏪᏍᎬᎢ, ᎾᏍᎩ ᎠᏓᏍᏓᏩᏗᏙᎯ ᎥᏝ ᎠᏛᏲᎱᏏ. ᎠᏎᏃ ᏥᏌ ᎥᏝ ᏴᏛᏲᎱᏏ ᎥᏝ ᏳᏬᏎᎴᎢ, ᎯᎠᏉᏍᎩᏂ ᏄᏪᏎᎸᎩ; ᎢᏳᏃ ᏥᎷᏨᎭ ᎬᏗᏍᎩ ᎡᎮᏍᏗ ᏯᏇᎵᏒ, ᎦᏙ ᎾᏍᎩ ᏨᏙᏗ.

source: This is the disciple who gives witness about these things and who put them in writing: and we have knowledge that his witness is true.
chr: ᎾᏍᎩ ᎯᎠ Ꮎ ᎠᏓᏍᏓᏩᏗᏙᎯ ᎯᎠ ᏥᎧᏃᎮᎭ, ᎠᎴ ᎾᏍᎩ ᎯᎠ ᎤᏬᏪᎳᏅᎯ ᏥᎩ, ᎠᎴ ᎢᏗᎦᏔᎭ ᎾᏍᎩ ᎧᏃᎮᏍᎬ ᎤᏙᎯᏳᎯᏯ ᎨᏒᎢ.

source: And Jesus did such a number of other things that, if every one was recorded, it is my opinion that even the world itself is not great enough for the books there would be.
chr: ᎠᎴ ᎠᏏ ᎤᏣᏔ ᏥᏌ ᏧᎸᏫᏍᏓᏁᎸᎯ, ᎾᏍᎩ ᎢᏳᏃ ᏂᎦᏛ ᏱᎪᏪᏔᏅ, ᎦᏓᏅᏖᏍᎬ ᎡᎶᎯ ᎾᏍᏉ ᏯᎧᎵᎩᏉ ᎪᏪᎵ ᎾᏍᎩ ᏗᎪᏪᎳᏅᎯ. ᎡᎺᏅ.

source: Acts of the Apostles
chr: ᎨᏥᏅᏏᏛ ᏄᎾᏛᏁᎵᏙᎸᎢ

source: I have given an earlier account, O Theophilus, of all the things which Jesus did, and of his teaching from the first,
chr: Ꭷ ᏗᎣᏈᎵ, ᎢᎬᏱᏱ ᏣᏉᏪᎳᏅᎩ ᎧᏃᎮᏍᎬᎩ ᏂᎦᏛ ᏥᏌ ᎤᎴᏅᎲ ᏚᎸᏫᏍᏓᏁᎸ ᎠᎴ ᏚᏕᏲᏅᎢ,

source: Till the day when he was taken up to heaven after he had given his orders, through the Holy Spirit, to the Apostles of whom he had made selection:
chr: ᎬᏂ ᎾᎯᏳ ᎢᎦ ᎠᏥᏌᎳᏓᏅ, ᎦᏳᎳ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎤᏩᏔᏅᎯ ᏧᏁᏤᎸᎯ ᏂᎨᏎ ᎨᏥᏅᏏᏛ ᎾᏍᎩ ᏧᏑᏰᏛ.

source: And to whom he gave clear and certain signs that he was living, after his death; for he was seen by them for forty days, and gave them teaching about the kingdom of God:
chr: ᎾᏍᎩ ᎾᏍᏉ ᎬᏃᏛ ᎬᏂᎨᏒ ᏂᏚᏛᏁᎴᎢ, ᎤᎩᎵᏲᏨᎯ ᏂᎨᏎᎢ, ᎤᏣᏘ ᏄᏜᏏᏛᏒᎾ ᎠᏙᎴᎰᎯᏍᏙᏗ ᎬᏗᏍᎬᎢ, ᏅᎦᏍᎪᎯ ᏧᏒᎯᏛ ᎬᏩᎪᎲᎢ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᎤᎬᏩᎵ ᎤᏃᎮᎸᎯ ᏂᎨᏎᎢ.

source: And when they were all together, with him, he gave them orders not to go away from Jerusalem, but to keep there, waiting till the word of the Father was put into effect, of which, he said, I have given you knowledge:
chr: ᏚᏂᎳᏫᏨᏃ ᏚᏁᏤᎴ ᏥᎷᏏᎵᎻ ᎤᏂᏄᎪᎢᏍᏗᏱ ᏂᎨᏒᎾ, ᎤᏂᎦᏘᏗᏍᏗᏱᏍᎩᏂ ᎠᎦᏴᎵᎨ ᎤᏚᎢᏍᏔᏅᎢ, ᎾᏍᎩ ᏍᎩᏯᏛᎦᏁᎸᎯ ᏥᎩ, [ᏚᏬᏎᎴᎢ.]

source: For the baptism of John was with water, but you will have baptism with the Holy Spirit, after a little time.
chr: ᏣᏂᏰᏃ ᎤᏙᎯᏳᎯ ᎠᎹ ᏓᏓᏬᏍᏗᏍᎬᎩ; ᏂᎯᏍᎩᏂ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᏙᏓᏰᏣᏬᏍᏔᏂ ᎢᎸᏍᎩᏉ ᎢᏳᏒᎯ.

source: So, when they were together, they said to him, Lord, will you at this time give back the kingdom to Israel?
chr: ᎿᏉᏃ ᎤᎾᏓᏟᏌᏅ ᎬᏩᏛᏛᏁᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ; ᏣᎬᏫᏳᎯ, ᎿᏉᏍᎪ ᎠᏰᎵ ᎪᏢᏒ ᏙᏛᎯᏁᎵ ᎢᏏᎵ?

source: And he said to them, It is not for you to have knowledge of the time and the order of events which the Father has kept in his control.
chr: ᎠᏎᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎥᏝ ᏂᎯ ᎢᏥᎦᏙᎥᎯᏍᏗ ᏱᎩ ᎢᏳ ᎠᎴ ᎾᎯᏳ ᏕᎨᏌᏗᏒᎢ, ᎾᏍᎩ ᎠᎦᏴᎵᎨ ᎤᏩᏒ ᎢᏧᏩᏁᎵᏓᏍᏗ ᏥᏄᏩᏅ.

source: But you will have power, when the Holy Spirit has come on you; and you will be my witnesses in Jerusalem and all Judaea and Samaria, and to the ends of the earth.
chr: ᎠᏎᏃ ᏓᏰᏣᎵᏂᎪᎯᏍᏔᏂ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎢᏥᎷᏤᎸᎭ, ᎠᎴ ᏍᎩᏃᎮᏍᎩ ᎨᏎᏍᏗ ᏥᎷᏏᎵᎻ ᎠᎴ ᏂᎬᎾᏛ ᏧᏗᏱ ᎠᎴ ᏌᎺᎵᏱ ᎠᎴ ᏂᎬᎾᏛ ᎡᎶᎯ.

source: And when he had said these things, while they were looking, he was taken up, and went from their view into a cloud.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏄᏪᏒ, ᎠᏏᏉ ᎤᎾᎦᏙᏍᏕ ᎠᏥᏌᎳᏓᏁᎢ, ᎤᎶᎩᎸᏃ ᏭᏕᎵᏤ ᏓᏂᎧᏅᎢ.

source: And while they were looking up to heaven with great attention, two men came to them, in white clothing,
chr: ᎠᏏᏉᏃ ᏭᎶᏒ ᎤᏯᏅᏒᎯ ᏫᏓᏂᎧᏁ ᎦᎸᎳᏗ, ᎬᏂᏳᏉ ᎠᏂᏔᎵ ᎠᏂᏍᎦᏯ ᏧᏁᎬ ᏧᎾᏄᏫ ᎤᎶᏗᏢ ᏚᎾᎴᏂᎴᎢ;

source: And said, O men of Galilee, why are you looking up into heaven? This Jesus, who was taken from you into heaven, will come again, in the same way as you saw him go into heaven.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏄᏂᏪᏎᎢ; ᎢᏥᏍᎦᏯ ᎨᎵᎵ ᎢᏤᎯ, ᎦᏙᏃ ᎢᏥᏙᎾᎠ ᎦᎸᎳᏗ ᏫᏙᏥᎧᎿ? ᎾᏍᎩ ᎯᎠ ᏥᏌ ᏤᏥᏯᏅᏏ ᎦᎸᎳᏗ ᏥᏫᎦᎶᎯ ᎾᏍᎩᏯ ᏅᏛᏛᏁᎵ ᏓᎦᎷᏥ ᏤᏥᎪᏩᏛ ᎦᎸᎳᏗ ᏥᏫᎦᎶᎯ.

source: Then they went back to Jerusalem from the mountain named Olivet, which is near Jerusalem, a Sabbath day's journey away.
chr: ᎿᏉᏃ ᏥᎷᏏᎵᎻ ᏫᎤᏂᎶᏎᎢ ᎣᎵᏩ ᏧᏙᎢᏛ ᎤᏌᎯᎸ ᎤᎾᏓᏅᏎᎢ, ᎾᏍᎩ ᏥᎷᏏᎵᎻ ᎾᎥ ᏥᎩ ᎤᎾᏙᏓᏆᏍᎬ ᎢᎦ ᎡᏅᏍᏗ ᎢᏴᏛ ᏥᎩ.

source: And when they came in, they went up into the room where they were living; Peter and John and James and Andrew, Philip and Thomas, Bartholomew and Matthew, James, the son of Alphaeus, and Simon the Zealot, and Judas, the son of James.
chr: ᎤᏂᏴᎸᏃ, ᎤᎾᎩᎳᏫᏎ ᎦᎸᎳᏗ ᎧᏅᏑᎸ ᏭᏂᏴᎴᎢ, ᎾᎿᏃ ᎠᏂᏁ ᏈᏓ ᎠᎴ ᏥᎻ ᎠᎴ ᏣᏂ ᎠᎴ ᎡᏂᏗ, ᏈᎵᎩᏃ ᎠᎴ ᏓᎻ, ᏆᏓᎳᎻ ᎠᎴ ᎹᏚ, ᏥᎻᏃ ᎡᎵᏈ ᎤᏪᏥ ᎠᎴ ᏌᏩᏂ ᎠᏏᎶᏗ, ᏧᏓᏏᏃ ᏥᎻ ᏗᎾᏓᏅᏟ.

source: And they all with one mind gave themselves up to prayer, with the women, and Mary the mother of Jesus, and his brothers.
chr: ᎾᏍᎩ ᎯᎠ ᏂᎦᏛ ᏌᏉ ᎢᎦᎦᏛ ᎾᏂᏲᎯᏍᏗᏍᎬᎾ ᎠᎾᏓᏙᎵᏍᏗᏍᎨᎢ ᎠᎴ ᎠᏂᏔᏲᎯᎮᎢ, ᎠᎴ ᎾᏍᏉ ᎠᏂᎨᏴ, ᎠᎴ ᎺᎵ ᏥᏌ ᎤᏥ, ᎠᎴ ᏥᏌ ᎠᎾᎵᏅᏟ.

source: And in those days Peter got up among the brothers (there were about one hundred and twenty of them), and said,
chr: ᎾᎯᏳᏃ ᏈᏓ ᎤᎴᏁ ᎠᏰᎵ ᎠᏂᏅ ᎠᏃᎯᏳᎲᏍᎩ, ᎾᏍᎩ ᎾᏂᎥ ᏚᎾᏙᎥ ᎠᏍᎪᎯᏧᏈ ᏔᎳᏍᎪᎯ ᎢᏴᏛ ᎨᏎᎢ, ᎯᎠᏃ ᏄᏪᏎᎢ;

source: My brothers, the word of God had to be put into effect, which the Holy Spirit had said before, by the mouth of David, about Judas, who was guide to those who took Jesus,
chr: ᎢᏥᏍᎦᏯ ᏗᏓᏓᏅᏟ, ᎯᎠ ᎪᏪᎸ ᎠᏎ ᎤᏙᎯᏳᏗ ᎨᏒᎩ, ᎾᏍᎩ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᏕᏫ ᎠᎰᎵ ᏧᏩᏔᏁ ᏧᏁᏤ ᏧᏓᏏ ᎠᏥᏃᎮᏍᎬᎢ, ᎾᏍᎩ ᏧᏘᏂᏙᎸᎯ ᏥᏌ ᏥᎬᏩᏂᏱᏍᎬᎩ;

source: For he was numbered among us, and had his part in our work.
chr: ᎾᏍᎩᏰᏃ ᎠᏴ ᎡᎦᎵᎪᏔᏅᎯ ᏥᎨᏒᎩ, ᎠᎴ ᎠᎨᎳᏗᏍᏔᏅᎯ ᏥᎨᏒ ᎯᎠ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ.

source: (Now this man, with the reward of his evil-doing, got for himself a field, and falling head first, came to a sudden and violent end there.
chr: ᎾᏍᎩᏃ ᎤᏍᎦᏅᏨᎢ ᏧᎬᏩᎳᏅᎯ ᏥᎤᏩᎯᏍᏔᏁ ᏠᎨᏏ, ᎤᏙᎠᏒᏃ ᏧᏣᎷᏘᏎᎢ, ᎠᎴ ᏂᎦᏛ ᏧᎵᎩᏏ ᏥᏚᏄᎪᏤᎢ.

source: And this came to the knowledge of all those who were living in Jerusalem, so that the field was named in their language, Akel-dama, or, The field of blood.)
chr: ᎾᏍᎩᏃ ᏂᎦᏛ ᏥᎷᏏᎵᎻ ᎠᏁᎯ ᎤᎾᏛᎦᏅᎩ, ᎾᏍᎩᏰᏃ ᏠᎨᏏ ᎤᎾᏤᎵᎦᏯ ᎤᏂᏬᏂᎯᏍᏗ ᎨᏒ ᎠᏅᏗᏍᎬ ᎠᏎᎵᏓᎹ ᏕᎤᏙᎥ, ᎾᏍᎩ ᎩᎬᏱ ᎦᏛᎦ.

source: For in the book of Psalms it says, Let his house be waste, and let no man be living in it: and, Let his position be taken by another.
chr: ᎯᎠᏰᏃ ᏂᎬᏅ ᎪᏪᎳ ᏗᎧᏃᎩᏍᏗ ᎪᏪᎵᎯ, “ᎦᏁᎸᎢ ᏅᏔ ᏫᏂᎦᎵᏍᏓ, ᎠᎴ ᏞᏍᏗ ᎩᎶ ᎾᎿ ᏳᏁᎳᏕᏍᏗ;” ᎠᎴ ᎾᏍᏉ ᎯᎠ ᏂᎬᏅ, “ᏧᎸᏫᏍᏓᏁᏗ ᎨᏒ ᏅᏩᏓᎴ ᏩᎩᏍᏓ.”

source: For this reason, of the men who have been with us all the time, while the Lord Jesus went in and out among us,
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎯᎠ ᎾᏍᎩ ᎠᏂᏍᎦᏯ ᎢᎨᏙᎸᎯ ᏥᎩ ᏂᎪᎯᎸ ᎤᎬᏫᏳᎯ ᏥᏌ ᎢᎨᎳᏗᏙᎸᎢ,

source: Starting from the baptism of John till he went up from us, one will have to be a witness with us of his coming back from death.
chr: ᏣᏂ ᏥᏓᏓᏬᏍᎬᎢ ᏅᏓᎬᏩᏓᎴᏅᏛ, ᎬᏂ ᎾᎯᏳ ᎢᎦ ᏣᏥᏌᎳᏓᏅ ᏤᎩᏯᏅᎡᎸᎩ, ᎾᏍᎩ ᎯᎠ ᎠᏂᏍᎦᏯ ᎠᏎ ᏌᏉ ᎠᏑᏰᏍᏍᏗ, ᎾᏍᎩ ᎢᎨᎳᏗᏓᏍᏗᏱ ᎤᏃᎮᏗᏱ ᏥᏌ ᏕᎤᎴᎯᏌᏅ ᎢᏗᏃᎮᏍᎬᎢ.

source: And they made selection of two, Joseph, named Barsabbas, whose other name was Justus, and Matthias.
chr: ᎠᏂᏔᎵᏃ ᏚᏂᎧᏁᎢ, ᏦᏩ ᏆᏏᏆ ᏧᏙᎢᏛ, ᏣᏍᏓ ᏣᎪᏎᎰᎢ, ᎹᏓᏯᏃ.

source: And they made prayers and said, Lord, having knowledge of the hearts of all men, make clear which of these two has been marked out by you,
chr: ᎤᎾᏓᏙᎵᏍᏔᏁᏃ ᎯᎠ ᏄᏂᏪᏎᎢ; ᏂᎯ ᏣᎬᏫᏳᎯ, ᏂᎦᏛ ᏧᏂᎾᏫ ᏘᎦᏔᎯ, ᎬᏂᎨᏒ ᏅᎦ ᎾᏍᎩ ᎯᎠ ᎠᏂᏔᎵ ᎨᏒ ᎾᏍᎩ ᎯᏯᏑᏰᏒᎢ,

source: To take that position as a servant and Apostle, from which Judas by his sin was shut out, so that he might go to his place.
chr: ᎤᏪᎳᏗᏓᏍᏗᏱ ᎯᎠ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎠᎴ ᎠᏓᏅᏏᏛ ᎨᏒᎢ, ᎾᏍᎩ ᏧᏓᏏ ᏥᏚᏲᏒᎩ ᎤᏩᏒ ᎤᏤᎵᎪᎯ ᏭᎶᎯᏍᏗᏱ.

source: And they put it to the decision of chance, and the decision was given for Matthias, and he was numbered with the eleven Apostles.
chr: ᎿᏉᏃ ᏚᎾᏎᏒᎮᎢ; ᎹᏓᏯᏃ ᎠᎦᏑᏰᏎᎢ; ᎠᎴ ᎠᎨᎳᏕ ᏌᏚ ᎾᏂᎥ ᎨᏥᏅᏏᏛ ᎤᎾᏓᏡᎬᎢ.

source: And when the day of Pentecost was come, they were all together in one place.
chr: ᎿᏉᏃ ᎯᏍᎦᏍᎪᎯᏁ ᎢᎦ ᎤᏍᏆᎸᎲ, ᏂᎦᏛ ᏌᏉ ᎢᎦᎦᏛ ᎤᎾᏓᏡᎨᎢ.

source: And suddenly there came from heaven a sound like the rushing of a violent wind, and all the house where they were was full of it.
chr: ᎤᏰᎶᎢᏍᏔᏁᏃ ᎤᏍᏆᏃᏴᎬ ᎦᎸᎳᏗ ᏧᎶᏎᎢ ᎾᏍᎩᏯ ᎤᏃᎴ ᎤᏣᏘ ᏣᏱᎵᏐᎢ, ᎤᎧᎵᎣᏁᏃ ᎠᏓᏁᎸ ᎾᎿ ᎠᏂᏅᎢ.

source: And they saw tongues, like flames of fire, coming to rest on every one of them.
chr: ᏚᏂᎪᎮᏃ ᏔᎵ ᎢᏧᏓᎢ ᏗᎦᏃᎦ ᎠᏥᎸ ᎾᏍᎩᏯᎢ, ᎠᎴ ᎾᏍᎩ ᏚᏂᏯᎸᏤ ᎠᏂᏏᏴᏫᎭ ᎨᏒᎢ.

source: And they were all full of the Holy Spirit, and were talking in different languages, as the Spirit gave them power.
chr: ᏂᎦᏛᏃ ᏚᏂᎧᎵᏤ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ, ᎠᎴ ᎤᎾᎴᏅᎮ ᏅᏩᎾᏓᎴ ᏧᏂᏬᏂᎯᏍᏗ ᏚᏂᏬᏂᏎᎢ, ᎾᏍᎩ ᎬᏩᏂᏁᎢᏍᏗ ᏄᏅᏁᎲ ᎠᏓᏅᏙ.

source: Now there were living at Jerusalem, Jews, God-fearing men, from every nation under heaven.
chr: ᏥᎷᏏᎵᎻᏃ ᎠᏁᏙᎮ ᎠᏂᏧᏏ ᎤᏁᎳᏅᎯ ᎠᏂᎾᏰᏍᎩ ᏅᏓᏳᏂᎶᏒᎯ ᏄᎾᏓᎴᏒ ᎠᏁᎲ ᏴᏫ ᎦᎸᎶ ᎭᏫᏂᏗᏢ.

source: And when this sound came to their ears, they all came together, and were greatly surprised because every man was hearing the words of the disciples in his special language.
chr: ᎿᏉᏃ ᎾᏍᎩ ᎤᏂᏃᎮᎵᏙᎸ ᎤᏂᏣᏘ ᏚᏂᎳᏫᏤᎢ ᎠᎴ ᎤᎾᏕᏯᏔᏁᎴᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏓᎾᏛᎦᏁᎲ ᏓᏂᏬᏂᏍᎬ ᏗᏂᏏᏴᏫᎭ ᏧᏂᏬᏂᎯᏍᏗ ᎨᏒᎢ.

source: And they were full of wonder and said, Are not all these men Galilaeans?
chr: ᎠᎴ ᏂᎦᏛ ᎤᏣᏔᏅᎯ ᎤᏂᏍᏆᏂᎪᏎᎢ, ᎯᎠ ᏂᏚᎾᏓᏪᏎᎴᎢ; Ᏺ! ᏝᏍᎪ ᏂᎦᏛ ᎯᎠ ᏣᏂᏬᏂᎭ ᎨᎵᎵ ᎠᏁᎯ ᏱᎩ?

source: And how is it that every one of us is hearing their words in the language which was ours from our birth?
chr: ᎦᏙᏃ ᏗᎦᎵᏍᏙᏗᎭ ᏥᏕᏓᏛᎩᎠ ᏗᏗᏏᏴᏫᎭ ᏕᎦᏛᏒ ᏗᎩᏬᏂᎯᏍᏗ?

source: Men of Parthia, Media, and Elam, and those living in Mesopotamia, in Judaea and Cappadocia, in Pontus and Asia,
chr: ᏆᏗᏱ ᎢᏕᎯ ᎠᎴ ᎻᏗᏱ ᎢᏕᎯ ᎠᎴ ᎢᎳᎻᏱ ᎢᏕᎯ ᎠᎴ ᎺᏌᏆᏕᎻ ᎢᏕᎯ, ᏧᏗᏱ ᎠᎴ ᎨᏆᏙᏏ ᎢᏕᎯ, ᏋᏗᏱᏃ ᎠᎴ ᎡᏏᏱ ᎢᏕᎯ,

source: In Phrygia and Pamphylia, in Egypt and the parts of Libya about Cyrene, and those who have come from Rome, Jews by birth and others who have become Jews,
chr: ᏈᏥᏱᏃ ᎠᎴ ᏆᎢᏈᎵᏱ ᎢᏕᎯ, ᎢᏥᏈᏃ ᎠᎴ ᎵᏈᏱ ᏌᎵᏂ ᎤᏚᏫᏛ ᎢᏕᎯ, ᎢᏕᏙᎯᏃ ᎶᎻ ᎢᏕᎯ, ᎢᏗᏧᏏ ᎠᎴ ᎠᏂᏧᏏ ᏗᏓᎵᎪᏁᎸᎯ,

source: Men of Crete and Arabia, to all of us they are talking in our different languages, of the great works of God.
chr: ᎩᎵᏗᏃ ᎠᎴ ᎠᎴᏈᏱ ᎢᏕᎯ, ᎢᏓᏛᎩᎭ ᏗᎩᏬᏂᎯᏍᏗ ᎨᏒ ᎠᏂᏬᏂᏍᎬᎢ, ᎤᏍᏆᏂᎪᏗᏳ ᎤᏁᎳᏅᎯ ᏚᎸᏫᏍᏓᏁᎸ ᎠᏂᏃᎮᏍᎬᎢ.

source: And they were all surprised and in doubt saying to one another, What is the reason of this?
chr: ᏂᎦᏛᏃ ᎤᏂᏍᏆᏂᎪᏎᎢ ᎠᎴ ᎤᎾᏓᏅᏖᏔᏁᎢ, ᎯᎠ ᏂᏚᎾᏓᏪᏎᎴᎢ, ᎦᏙ ᎯᎠ ᎦᏛᎦ?

source: But others, making sport of them, said, They are full of new wine.
chr: ᎢᎦᏛᏃ ᏓᎾᏕᎰᏗᏍᎬ ᎯᎠ ᏄᏂᏪᏎᎢ; ᎢᏤ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ ᏚᏂᎧᎵᏨ.

source: But Peter, getting up, with the eleven, said in a loud voice, O men of Judaea, and all you who are living in Jerusalem, take note of this and give ear to my words.
chr: ᎿᏉᏃ ᏈᏓ ᏌᏚ ᎢᏯᏂᏛ ᎠᏂᏙᎾᎥ ᎦᏙᎬᎢ, ᎠᏍᏓᏯ ᎤᏁᏤ ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎢᏥᏍᎦᏯ ᎢᏥᏧᏏ, ᎠᎴ ᏂᎦᏛ ᏥᎷᏏᎵᎻ ᎢᏤᎯ, ᎯᎠ ᎾᏍᎩ ᎢᏣᏅᏖᏍᏗ, ᎠᎴ ᎢᏣᏛᏓᏍᏓ ᏥᏁᎬᎢ.

source: For these men are not overcome with wine, as it seems to you, for it is only the third hour of the day;
chr: ᎥᏝᏰᏃ ᎯᎠ ᏱᏚᏂᏴᏍᏕᎭ ᏚᏂᏴᏍᏕᎭ ᏥᏤᎵᎭ, ᎠᏏᏰᏃ ᏐᎣᏁᎳᏉ ᎢᏳᏟᎶᏛ ᎧᎳᏩᏗᏒᎢ.

source: But this is the thing which was said by the prophet Joel;
chr: ᎾᏍᎩᏍᎩᏂ ᎯᎠ ᏦᎢᎵ ᎠᏙᎴᎰᏍᎩ ᏧᏁᏤᎢ, ᎯᎠ ᏥᏄᏪᏎᎢ;

source: And it will come about, in the last days, says God, that I will send out my Spirit on all flesh; and your sons and your daughters will be prophets, and your young men will see visions, and your old men will have dreams:
chr: “ᎯᎠᏃ ᏅᏓᎦᎵᏍᏔᏂ ᎤᎵᏍᏆᎸᏗ ᎨᏎᏍᏗ ᎠᏗᎭ ᎤᏁᎳᏅᎯ, ᏂᎦᎥ ᎤᏇᏓᎵ ᎨᏒ ᎠᏆᏓᏅᏙ ᏓᏥᏯᏐᏅᏰᎵ, ᏗᏤᏥᏃ ᎠᏂᏍᎦᏯ ᎠᎴ ᏗᏤᏥ ᎠᏂᎨᏴ ᎠᎾᏙᎴᎰᏍᎨᏍᏗ, ᎠᏂᏫᏅᏃ ᏗᏣᏤᎵ ᎤᎾᏁᎳᏫᏎᎮᏍᏗ, ᏧᎾᏛᏐᏅᎯᏃ ᏗᏣᏤᎵ ᎠᎾᏍᎩᏓᏒᎥᏍᎨᏍᏗ;

source: And on my men-servants and my women-servants I will send my Spirit, and they will be prophets.
chr: ᎠᎴ ᎾᎯᏳ ᎠᏆᏓᏅᏙ ᏓᎦᏥᏯᏐᏅᏰᎵ ᎦᏥᏅᏏᏓᏍᏗ ᎠᏂᏍᎦᏯ ᎠᎴ ᎠᏂᎨᏴ, ᎠᎾᏙᎴᎰᏍᎨᏍᏗᏃ.

source: And wonders will be seen in heaven, and signs on the earth, blood and fire and smoke:
chr: ᎠᎴ ᎤᏍᏆᏂᎪᏗ ᎦᎸᎶ ᎦᎸᎳᏗ ᏓᏥᎾᏄᎪᏫᏏ ᎠᎴ ᎤᏰᎸᏛ ᎡᎶᎯ ᎡᎳᏗ, ᎩᎬ ᎠᎴ ᎠᏥᎸ ᎠᎴ ᏧᎦᏒᏍᏗ.

source: The sun will become dark and the moon will be turned to blood, before that great day of the Lord comes in glory:
chr: ᏅᏙ ᎢᎦ ᎡᎯ ᎤᎵᏏᎩᏳ ᏅᏓᎦᎵᏍᏔᏂ, ᏅᏙᏃ ᏒᏃᏱ ᎡᎯ ᎩᎬ ᏅᏓᎦᎵᏍᏔᏂ, ᎤᏍᏆᎸᎯᏕᎾ ᎨᏎᏍᏗ ᎾᎯᏳ ᎢᎦ ᎦᎸᏉᏗᏳ ᎠᎴ ᎤᏍᏆᏂᎪᏗᏳ ᏱᎰᏩ ᎤᏤᎵᎦ.
